//数字引脚4~11分别接8字数码管的a~h端，每一端都要串联一个电阻
int number[20][8]={
{1,1,1,1,1,1,0,0},
{0,1,1,0,0,0,0,0},
{1,1,0,1,1,0,1,0},
{1,1,1,1,0,0,1,0},
{0,1,1,0,0,1,1,0},
{1,0,1,1,0,1,1,0},
{1,0,1,1,1,1,1,0},
{1,1,1,0,0,0,0,0},
{1,1,1,1,1,1,1,0},
{1,1,1,1,0,1,1,0}};

void setup() {
for (int i=4;i<=11;i++)
{
  pinMode(i,OUTPUT);
}

}

void loop() {
for (int m=0;m<=9;m++)
{ 
  int pin=3;
  for (int n=0;n<=7;n++)
  {
    pin++;
    digitalWrite(pin,number[m][n]);
    
  }
  delay(1000);
  digitalWrite(pin,1);//显示小数点
  delay(1000);  
}
}
